Revit 2024 API
SpecTypeId.UnitWeight Property
 Unit Weight, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId UnitWeight { get; }
Visual Basic
Public Shared ReadOnly Property UnitWeight As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ UnitWeight {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace